Revit 2023 API
GroupTypeId.MechanicalLoads Property
 "Mechanical - Loads"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId MechanicalLoads { get; }
Visual Basic
Public Shared ReadOnly Property MechanicalLoads As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ MechanicalLoads {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace